In [49]:
import pandas as pd 
import numpy as np

In [50]:
df=pd.read_csv("D:/MACHINE  LEARNING/Machine learning using Python/cars.csv")

In [51]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [52]:
df.sample(5)

         brand  km_driven    fuel         owner  selling_price
4901       BMW     122000  Diesel  Second Owner        1100000
3503   Hyundai      80000  Petrol   First Owner         378000
1229    Maruti      89100  Diesel  Second Owner         351000
7635   Hyundai      45000  Petrol   First Owner         525000
2735  Mahindra      35000  Diesel   First Owner         750000

In [53]:
df['brand'].value_counts().sum()

np.int64(8128)

In [54]:
df['brand'].nunique()

32

In [55]:
df['fuel'].nunique()

4

In [56]:
df['fuel'].value_counts()

fuel
Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: count, dtype: int64

In [57]:
df['owner'].nunique()

5

In [58]:
print(df.dtypes)

brand            object
km_driven         int64
fuel             object
owner            object
selling_price     int64
dtype: object

## 1 OneHOtEncoding Using pAndas

In [59]:
df_encoded = pd.get_dummies(df, columns=['fuel', 'owner'])
df_encoded = df_encoded.apply(lambda col: col.astype(int) if col.dtype == 'bool' else col)

In [60]:
df_encoded.head()

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0

# n-1 (solve multicollinearity problem)

In [61]:
df_encoded = pd.get_dummies(df, columns=['fuel', 'owner'],drop_first=True)
df_encoded = df_encoded.apply(lambda col: col.astype(int) if col.dtype == 'bool' else col)

In [62]:
df_encoded.head()

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,1,0,0,0,0,0,0
1,Skoda,120000,370000,1,0,0,0,1,0,0
2,Honda,140000,158000,0,0,1,0,0,0,1
3,Hyundai,127000,225000,1,0,0,0,0,0,0
4,Maruti,120000,130000,0,0,1,0,0,0,0

# pandas dont remember which column is is what positioned if you do again it will generate different result therefore you not able to apply this on machine learning project so thats why use scikit learner encoder class

# 3 ONEHotCoding using scikit learn

In [63]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [65]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(df.iloc[:,0:2],df.iloc[:,-1],test_size=0.2,random_state=2)

In [ ]:
from sklearn.preprocessing import OneHotEncoder